Revit 2024 API
ViewDisplaySketchyLines Class
 Represents the settings for sketchy lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class ViewDisplaySketchyLines : IDisposable
Visual Basic
Public Class ViewDisplaySketchyLines _
	Implements IDisposable
Visual C++
public ref class ViewDisplaySketchyLines : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ViewDisplaySketchyLines
See Also
ViewDisplaySketchyLines Members
Autodesk.Revit.DB Namespace